app/controllers/sessions_controller.rb

  def login
    mail = params[:email]
    pass = params[:password]

    expa = EXPA.setup()
    expa.auth(mail,pass)

    if expa.get_token.nil?
      flash[:warning] = "E-mail ou senha inválida"
      redirect_to(:action => "error") #TODO
    else
      user = ExpaPerson.find_by_xp_email(mail)
      if user.nil?
        user = ExpaPerson.new
        user.update_from_expa(EXPA::CurrentPerson.get_current_person)
      end
      user.update_from_expa(EXPA::People.find_by_id(user.xp_id))
      user.save
---
SELECT  "expa_people".* FROM "expa_people" WHERE "expa_people"."xp_id" IS NULL LIMIT 1
INSERT INTO "expa_people" ("xp_id", "xp_email", "xp_url", "xp_birthday_date", "xp_full_name", "xp_last_name", "xp_profile_photo_url", "xp_home_lc_id", "xp_home_mc_id", "xp_status", "xp_interviewed", "xp_created_at", "xp_updated_at", "xp_views", "xp_favourites_count", "xp_gender", "xp_address_info", "xp_contact_info", "xp_current_office_id", "xp_cv_info", "xp_cover_photo_urls", "xp_profile", "xp_missing_profile_fields", "xp_nps_score", "xp_permissions", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)